"""
en: Module for set lists control phrases
ru: Модуль для установки списков фраз управления
"""

# en: Hello phrases / ru: Фразы приветствия
HELLO = {
    'привет',
    'здравствуй',
    'здравствуйте',
    'здорово',
    'добрый день',
    'добрый вечер',
    'доброе утро',
    'доброго времени суток',
    'доброго дня',
    'доброго вечера',
    'доброго утра',
}

# en: Phrases can't be pronounced / ru: Фразы, которые нельзя произносить
HATE = {
    'давай',
    'давайте'
}

# en: Phrases to invite to play / ru: Фразы для приглашения поиграть
PLAY = {
    'поиграем',
    'сыграем',
    'сыграем',
    'играем',
    'играть',
    'поиграть'
}

# en: Phrases to ask for help / ru: Фразы для запроса помощи
HELP = {
    'помощь',
    'help',
    'help me',
    'помоги',
    'помогите'
}

# en: Phrases to conversation about the dream / ru: Фразы для разговора о снах
DREAM = {
    'сон',
    'сна',
    'сну',
    'сном',
    'сне',
    'сны',
    'снов',
    'снам',
    'сны',
    'снами',
    'снах',
    'сновидение',
    'присниться',
    'сниться',
    'снилось',
    'приснилось',
    'приснились',
    'снился',
    'снилась',
    'снится',
    'снятся',
    'приснится',
    'приснятся',
    'приснился',
    'приснилась',
}

# en: Phrases to conversation about the time / ru: Фразы для разговора о времени
TIME = {
    'время',
    'времени',
    'временем',
    'времена',
    'временами',
    'временях',
    'времен',
    'временам',
    'времена',
    'временами',
    'временах',
    'временной',
    'временного',
    'временному',
    'временным',
    'временном',
    'временная',
    'временную',
}

# en: Phrases to get good news / ru: Фразы для получения хороших новостей
GET_GOOD_NEWS = {
    'расскажи хорошую новость',
    'скажи хорошую новость',
    'напиши хорошую новость',
    'поделись хорошей новостью',
    'у тебя есть хорошие новости'
}

# en: Phrases to set good news / ru: Фразы для установки хороших новостей
SET_GOOD_NEWS = 'моя хорошая новость:'

# en: Phrases to get the tale about Piter Pen / ru: Фразы для получения сказки о Питере Пэне
PITER_PAN = {
    'питер пэн',
    'питер пен',
    'питерпен',
    'питерпэн',
}

# en: Phrases to set the message / ru: Фразы для установки сообщения
SET_MESSAGE = {
    'мое послание:',
    'мое сообщение:',
    'моё послание:',
    'моё сообщение:'
}
